Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge.SplitPositions Property
 The split positions of the analysis edge.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisPosition> SplitPositions { get; }
Public ReadOnly Property SplitPositions As List(Of AnalysisPosition)
	Get
Property Value
Type: List<AnalysisPosition>
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace